app/views/users/show.html.erb

SELECT "data_points".* FROM "data_points" WHERE "data_points"."user_id" = 10
---

<% @user.data_points.each do |data_point| %>