app/controllers/data_points_controller.rb

SELECT "data_points".* FROM "data_points"
---
  def index
    @data_points = DataPoint.all

SELECT "data_points".* FROM "data_points" WHERE "data_points"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
     @data_point = DataPoint.find(params[:id])

SELECT "data_points".* FROM "data_points" WHERE "data_points"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @data_point = DataPoint.find(params[:id])

INSERT INTO "data_points" ("calories", "created_at", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @data_point = DataPoint.new(params[:data_point])
    @data_point.user_id = current_user.id
    respond_to do |format|
      if @data_point.save