app/controllers/data_points_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 9 LIMIT 1
---
  def show
    @data_point = DataPoint.includes(:comments => :user).find(params[:id])