app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by_email(params[:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'lginoux@gmail.com' LIMIT 1

  def update
    @user.password = params[:user][:password]
    @user.password_confirmation = params[:user][:password_confirmation]
    if @user.save
---
UPDATE "users" SET "password_salt" = 'gK1kTGgTgoxlQTBQawC2', "crypted_password" = '4d0cce31b1176dd40034e900ed5573880e4a1c9b1e69bce06530e2000716a593b0f5721791a9233535e4fc2f7911692697acfb880fe24f983f683042137c7c22', "persistence_token" = '85c727d3c8486679a30e89ce619ef1fc642b11ef42d44921a5e19d5e3792beab357ac09020a3cac9b8d2e0ca521daa651599fa1b1edfa26c4ad561b5006a7de4', "updated_at" = '2012-05-07 15:52:48.758341' WHERE "users"."id" = 1

  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])
---
SELECT "users".* FROM "users" WHERE (perishable_token = 'fG4DurTsVwSWPEFxnXER' and updated_at > '2012-05-07 15:13:19.977603') LIMIT 1