app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    if @user_session.save
      user = User.first(:conditions => {:username=> @user_session.username.downcase})
---
SELECT "users".* FROM "users" WHERE ("users".username LIKE 'lginoux') LIMIT 1