app/controllers/users_controller.rb

  def index
    if params[:total_leaderboard_page]
      @update = "allTimeLeaderboard"
    elsif params[:leaderboard_page]
      @update = "leaderboard"
    elsif params[:slackerboard_page]
      @update = "slackerboard"
    elsif params[:latest_member_page]
      @update = "latestMembers"
    end


    if @update.nil? || @update == "allTimeLeaderboard"
      pos = current_user.positionLeadership()
      @total_leaderboard_users = User.total_leaderboard().paginate(:per_page => nb_total_leaderboard_users_per_page, :page => params[:total_leaderboard_page])
---
SELECT "users".* FROM "users"

  def show
    @user = User.includes(:preference).first(:conditions => {:username=> params[:username]})
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'lginoux' LIMIT 1

  def create

    params[:user][:username] = params[:user][:username].downcase
    params[:user][:email] = params[:user][:email].downcase
    puts params[:user]
    @user = User.new
    @user.data_points.build
    @user = User.new(params[:user])
    @url = register_path
    # we came to registration page from an authentifaction provider page, we redirect here because the password needs to be filled
    if session[:omniauth]
      @user.authentications.build(:provider => session[:omniauth][:provider], :uid => session[:omniauth][:uid], :username => session[:omniauth][:username] , :access_token => session[:omniauth][:access_token])
      if session[:omniauth][:image]
        @user.picture = open(session[:omniauth][:image])
      end
      #we verify directly the account, no need to verify email
      if @user.verify!
        user_session = UserSession.new(User.find_by_single_access_token(@user.single_access_token))

        user_session.save
---
INSERT INTO "users" ("confirmed", "created_at", "crypted_password", "email", "password_salt", "perishable_token", "persistence_token", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "perishable_token" = 'lHmxdwVoZf2RSwfh6LN', "updated_at" = '2012-05-07 18:26:46.575610' WHERE "users"."id" = 2

  def update
    @user = current_user
    @url = edit_user_path(:username=> current_user.username)
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "username" = 'lginoux', "password_salt" = 'sgNhKMmjd9XDNEZIYlnd', "crypted_password" = 'b4a5c7a396ee9d49bdbe0ad53bebafea4c40ce6eeab55e97b6f1fe568d668b97780a80e3f31dd575f113ba568b357f2f9554baf2224234814cc628261f189bea', "persistence_token" = '8283eb63bbc36a751137366ba8bcaebf3e5a4b06b54adea627f0250337321da455b691199f23cd20804d591ef8936dd361e534c2d83ad6f4a7489b8dd9bd3237', "updated_at" = '2012-05-07 18:44:01.023151' WHERE "users"."id" = 7

  def destroy
    @user = User.first(:conditions => {:username=> params[:username]})
    @user.picture.destroy
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'lginoux' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]