app/controllers/user_verifications_controller.rb

  def load_user_using_perishable_token
    @user = User.find_using_perishable_token(params[:id])
---
SELECT "users".* FROM "users" WHERE (perishable_token = 'BC4UGg0xJvZczkcPk2iY' and updated_at > '2012-05-07 18:29:56.600916') LIMIT 1